In [3]:
import pandas as pd
import numpy as np

In [ ]:
#introduction to pandas data structure
a=pd.Series([2,4,6,8])
a

0    2
1    4
2    6
3    8
dtype: int64

In [ ]:
a.values

array([2, 4, 6, 8])

In [ ]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
b=pd.Series([1,2,3,4], index=['a','b','c','d'])
print(b)
b.index

a    1
b    2
c    3
d    4
dtype: int64

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
b['a']

1

In [ ]:
b['e']=5
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
sdata={'aa':11,'bb':22,'cc':33}
s=pd.Series(sdata)
s

aa    11
bb    22
cc    33
dtype: int64

In [ ]:
pd.isnull(s)

aa    False
bb    False
cc    False
dtype: bool

In [ ]:
#dataframe
df=pd.DataFrame({'Name':['Komal','Varsha','Rahul','Aruna','Manoj'],
                'Age':[24,26,29,22,30]})
df

     Name  Age
0   Komal   24
1  Varsha   26
2   Rahul   29
3   Aruna   22
4   Manoj   30

In [ ]:
df.loc[1]

Name    Varsha
Age         26
Name: 1, dtype: object

In [ ]:
df['City']='karad'
df

     Name  Age   City
0   Komal   24  karad
1  Varsha   26  karad
2   Rahul   29  karad
3   Aruna   22  karad
4   Manoj   30  karad

In [ ]:
df.T

          0       1      2      3      4
Name  Komal  Varsha  Rahul  Aruna  Manoj
Age      24      26     29     22     30
City  karad   karad  karad  karad  karad

In [ ]:
df.values

array([['Komal', 24, 'karad'],
       ['Varsha', 26, 'karad'],
       ['Rahul', 29, 'karad'],
       ['Aruna', 22, 'karad'],
       ['Manoj', 30, 'karad']], dtype=object)

In [ ]:
df

     Name  Age   City
0   Komal   24  karad
1  Varsha   26  karad
2   Rahul   29  karad
3   Aruna   22  karad
4   Manoj   30  karad

In [ ]:
df[2:]

    Name  Age   City
2  Rahul   29  karad
3  Aruna   22  karad
4  Manoj   30  karad

In [ ]:
df=df.drop(2)
df

     Name  Age   City
0   Komal   24  karad
1  Varsha   26  karad
3   Aruna   22  karad
4   Manoj   30  karad

In [ ]:
import numpy as np

obj=pd.Series(np.arange(4))
obj

0    0
1    1
2    2
3    3
dtype: int64

In [ ]:
df.iloc[2:4]

    Name  Age   City
3  Aruna   22  karad
4  Manoj   30  karad

In [ ]:
df.loc[2:4]

    Name  Age   City
3  Aruna   22  karad
4  Manoj   30  karad

In [4]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorada'])
df2=pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

print(df1)
print(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorada  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
df1+df2

            b   c     d   e
Colorada  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [ ]:
df1.idxmax()

b    Colorada
c    Colorada
d    Colorada
dtype: object

In [ ]:
df1.describe()

         b    c    d
count  3.0  3.0  3.0
mean   3.0  4.0  5.0
std    3.0  3.0  3.0
min    0.0  1.0  2.0
25%    1.5  2.5  3.5
50%    3.0  4.0  5.0
75%    4.5  5.5  6.5
max    6.0  7.0  8.0

In [ ]:
df1.cumsum()

            b     c     d
Ohio      0.0   1.0   2.0
Texas     3.0   5.0   7.0
Colorada  9.0  12.0  15.0

In [6]:
df1.corr()

     b    c    d
b  1.0  1.0  1.0
c  1.0  1.0  1.0
d  1.0  1.0  1.0

In [9]:
df1.value_counts()

b    c    d
6.0  7.0  8.0    1
3.0  4.0  5.0    1
0.0  1.0  2.0    1
dtype: int64